---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.FailedConvertWallToPanel
source: html/9538bef7-16d8-543c-740e-6ff6bee4dc8c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.FailedConvertWallToPanel Property

Unable to convert wall to panel.

## Syntax (C#)
```csharp
public static FailureDefinitionId FailedConvertWallToPanel { get; }
```